#+AUTHOR:      Arnaud Legrand
#+TITLE:       Design of Experiments
#+DATE:        MOSIG Lecture
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+STARTUP: beamer overview indent
#+TAGS: noexport(n)
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel-style-preembule.tex}

#+LaTeX: \input{org-babel-document-preembule.tex}

*** Generating a $2^p$ Design
\small
#+begin_src R :results output :session :exports both
library(FrF2)
d1 = FrF2(nruns=8 ,nfactors=3 , blocks=1 , replications = 2,  
        randomize= TRUE, seed= 26052 , 
        factor.names=list(A=c(-1,1), B=c(-1,1), C=c(-1,1))); d1 ;
#+end_src

#+RESULTS:
#+begin_example
 creating full factorial with 8 runs ...

   run.no run.no.std.rp  A  B  C
1       1           2.1  1 -1 -1
2       2           6.1  1 -1  1
3       3           3.1 -1  1 -1
4       4           5.1 -1 -1  1
...
15     15           1.2 -1 -1 -1
16     16           4.2  1  1 -1
class=design, type= full factorial 
NOTE: columns run.no and run.no.std.rp are annotation, not part of the data frame
#+end_example

#+LaTeX: \normalsize \centerline{\alert{\bf How can we analyze something like this?}}
*** A simple ANOVA in R
\small
#+begin_src R :results output :session :exports both
d1_aov <- aov(Response ~ (A + B + C)^2, data=d1)
summary(d1_aov) # summary will call summary.aov
#+end_src

#+RESULTS:
#+begin_example
            Df Sum Sq Mean Sq F value   Pr(>F)    
A            1  22.98   22.98  38.318 0.000161 ***
B            1  68.02   68.02 113.417 2.11e-06 ***
C            1  77.60   77.60 129.402 1.21e-06 ***
A:B          1   0.44    0.44   0.728 0.415721    
A:C          1   0.93    0.93   1.555 0.243804    
B:C          1  14.62   14.62  24.374 0.000806 ***
Residuals    9   5.40    0.60                     
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
#+end_example

\medskip\normalsize
So, *all factors are significant* and there is *a significant
interaction between B and C*
*** Can't I just read my linear regression as usual?
\scriptsize

#+begin_src R :results output :session :exports both
summary.lm(d1_aov)
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = Response ~ (A + B + C)^2, data = d1)

Residuals:
     Min       1Q   Median       3Q      Max 
-1.01845 -0.48073 -0.01537  0.45886  0.98771 

Coefficients:
            Estimate Std. Error t value Pr(>|t|)    
(Intercept)  19.5912     0.1936 101.194 4.56e-15 ***
A1            1.1984     0.1936   6.190 0.000161 ***
B1            2.0618     0.1936  10.650 2.11e-06 ***
C1            2.2023     0.1936  11.375 1.21e-06 ***
A1:B1         0.1652     0.1936   0.853 0.415721    
A1:C1         0.2415     0.1936   1.247 0.243804    
B1:C1         0.9558     0.1936   4.937 0.000806 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.7744 on 9 degrees of freedom
Multiple R-squared:  0.9716,	Adjusted R-squared:  0.9527 
F-statistic:  51.3 on 6 and 9 DF,  p-value: 1.873e-06
#+end_example

#+BEGIN_LaTeX
\pause
\begin{overlayarea}{.6\linewidth}{0cm}
  \vspace{-7.3cm}
  \begin{block}{}
    \normalsize
    \centerline{Wait, why is the formula so different?} $$10 + 2A + 3BC$$
  \end{block}
\end{overlayarea}
\pause
\begin{overlayarea}{.6\linewidth}{0cm}
  \vspace{-2.3cm}
  \begin{block}{}
    \normalsize
    \begin{center}
       Because it treated the factors "-1" and "1" as $0$ and $1$...
    \end{center}
  \end{block}
\end{overlayarea}

#+END_LaTeX
*** Then how do I get the formula I expected? (1/2)
\small
#+begin_src R :results output :session :exports both
d1_lm <- lm(Response ~ (as.numeric(A) + as.numeric(B) + 
            as.numeric(C))^2, data=d1)
summary.aov(d1_lm)
#+end_src

#+RESULTS:
#+begin_example
                            Df Sum Sq Mean Sq F value   Pr(>F)    
as.numeric(A)                1  22.98   22.98  38.318 0.000161 ***
as.numeric(B)                1  68.02   68.02 113.417 2.11e-06 ***
as.numeric(C)                1  77.60   77.60 129.402 1.21e-06 ***
as.numeric(A):as.numeric(B)  1   0.44    0.44   0.728 0.415721    
as.numeric(A):as.numeric(C)  1   0.93    0.93   1.555 0.243804    
as.numeric(B):as.numeric(C)  1  14.62   14.62  24.374 0.000806 ***
Residuals                    9   5.40    0.60                     
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
#+end_example

\normalsize
Sweet, it's the same as the previous ANOVA
*** Then how do I get the formula I expected? (2/2)
\scriptsize
#+begin_src R :results output :session :exports both
summary(d1_lm) # summary will call summary.lm
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = Response ~ (as.numeric(A) + as.numeric(B) + 
    as.numeric(C))^2, data = d1)

Residuals:
     Min       1Q   Median       3Q      Max 
-1.01845 -0.48073 -0.01537  0.45886  0.98771 

Coefficients:
                            Estimate Std. Error t value Pr(>|t|)    
(Intercept)                  15.4654     3.1870   4.853 0.000905 ***
as.numeric(A)                -0.0429     1.6878  -0.025 0.980277    
as.numeric(B)                -2.6022     1.6878  -1.542 0.157516    
as.numeric(C)                -2.7789     1.6878  -1.647 0.134064    
as.numeric(A):as.numeric(B)   0.6606     0.7744   0.853 0.415721    
as.numeric(A):as.numeric(C)   0.9658     0.7744   1.247 0.243804    
as.numeric(B):as.numeric(C)   3.8232     0.7744   4.937 0.000806 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.7744 on 9 degrees of freedom
Multiple R-squared:  0.9716,	Adjusted R-squared:  0.9527 
F-statistic:  51.3 on 6 and 9 DF,  p-value: 1.873e-06
#+end_example

#+BEGIN_LaTeX
\pause
\begin{overlayarea}{.6\linewidth}{0cm}
  \vspace{-8.7cm}
  \begin{block}{}
    \begin{center}
      \normalsize Variability is too large too obtain good
      estimates of the \alert{true coefficients}\\[-2em]
      $$10 + 2A + 3BC$$

      \alert{One should anyway use other kind of designs to
         estimate continuous model parameters}
    \end{center}
  \end{block}
\end{overlayarea}
#+END_LaTeX
*** Fractional designs
\small
#+begin_src R :results output :session :exports both
d2 = FrF2(nruns=8 ,nfactors=4 , blocks=1 , replications = 2,  
        randomize= TRUE, seed= 26052 , 
        factor.names=list(A=c(-1,1), B=c(-1,1), C=c(-1,1), D=c(-1,1))); 
d2 ;
#+end_src

#+RESULTS:
#+begin_example
   run.no run.no.std.rp  A  B  C  D
1       1           2.1  1 -1 -1  1
2       2           6.1  1 -1  1 -1
3       3           3.1 -1  1 -1  1
4       4           5.1 -1 -1  1  1
5       5           8.1  1  1  1  1
...
13     13           2.2  1 -1 -1  1
14     14           5.2 -1 -1  1  1
15     15           1.2 -1 -1 -1 -1
16     16           4.2  1  1 -1 -1
class=design, type= FrF2 
NOTE: columns run.no and run.no.std.rp are annotation, 
      not part of the data frame
#+end_example

#+BEGIN_LaTeX
\begin{flushright}
  \begin{overlayarea}{.4\linewidth}{0cm}
    \vspace{-5.7cm}
    \begin{block}{}
      Not much gain here... Fractional designs have constraints
      but allow you to control how much you loose
    \end{block}
  \end{overlayarea}
\end{flushright}

#+END_LaTeX
*** Saving a lot of time/money: Plackett-Burman screening designs
\scriptsize
#+begin_src R :results output :session :exports both
d3 <-  pb(nruns= 20 ,n12.taguchi= FALSE ,nfactors= 20 -1, ncenter= 0 , 
    replications= 1 ,repeat.only= FALSE ,randomize= TRUE ,seed= 26654 , 
    factor.names=list( A=c(-1,1),B=c(-1,1),C=c(-1,1),D=c(-1,1),
     E=c(-1,1),F=c(-1,1),G=c(-1, 1),H=c(-1,1),J=c(-1,1),K=c(-1,1),
     L=c(-1,1),M=c(-1,1),N=c(-1,1),O=c(-1,1),P=c(-1,1) ) ) ; d3
#+end_src

#+RESULTS:
#+begin_example
    A  B  C  D  E  F  G  H  J  K  L  M  N  O  P e1 e2 e3 e4
1   1  1  1 -1  1 -1  1 -1 -1 -1 -1  1  1 -1  1  1 -1 -1  1
2  -1  1 -1 -1 -1 -1  1  1 -1  1  1 -1 -1  1  1  1  1 -1  1
3  -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1
4   1 -1 -1  1  1  1  1 -1  1 -1  1 -1 -1 -1 -1  1  1 -1  1
5  -1 -1  1  1 -1  1  1 -1 -1  1  1  1  1 -1  1 -1  1 -1 -1
6  -1 -1  1  1  1  1 -1  1 -1  1 -1 -1 -1 -1  1  1 -1  1  1
7   1  1 -1  1  1 -1 -1  1  1  1  1 -1  1 -1  1 -1 -1 -1 -1
8  -1  1  1 -1  1  1 -1 -1  1  1  1  1 -1  1 -1  1 -1 -1 -1
9   1 -1  1 -1 -1 -1 -1  1  1 -1  1  1 -1 -1  1  1  1  1 -1
10  1  1 -1 -1  1  1  1  1 -1  1 -1  1 -1 -1 -1 -1  1  1 -1
11 -1  1  1  1  1 -1  1 -1  1 -1 -1 -1 -1  1  1 -1  1  1 -1
12  1  1  1  1 -1  1 -1  1 -1 -1 -1 -1  1  1 -1  1  1 -1 -1
13 -1 -1 -1  1  1 -1  1  1 -1 -1  1  1  1  1 -1  1 -1  1 -1
14  1 -1 -1 -1 -1  1  1 -1  1  1 -1 -1  1  1  1  1 -1  1 -1
15  1 -1  1  1 -1 -1  1  1  1  1 -1  1 -1  1 -1 -1 -1 -1  1
16  1  1 -1  1 -1  1 -1 -1 -1 -1  1  1 -1  1  1 -1 -1  1  1
17 -1  1 -1  1 -1 -1 -1 -1  1  1 -1  1  1 -1 -1  1  1  1  1
18 -1 -1 -1 -1  1  1 -1  1  1 -1 -1  1  1  1  1 -1  1 -1  1
19  1 -1  1 -1  1 -1 -1 -1 -1  1  1 -1  1  1 -1 -1  1  1  1
20 -1  1  1 -1 -1  1  1  1  1 -1  1 -1  1 -1 -1 -1 -1  1  1
class=design, type= pb
#+end_example

#+BEGIN_LaTeX
\begin{flushright}
  \begin{overlayarea}{.25\linewidth}{0cm}
    \vspace{-5.7cm}
    \begin{block}{}
#+END_LaTeX
      \small
      Only allows to estimate *primary factors*, *not interations*\medskip

      Preliminary step for further investigation
#+BEGIN_LaTeX
    \end{block}
  \end{overlayarea}
\end{flushright}
#+END_LaTeX
*** General Full Factorial Experiments
\scriptsize
#+begin_src R :results output :session :exports both
d4 <- fac.design(nfactors= 2 ,replications= 3 ,repeat.only= FALSE ,
                 blocks= 1 , randomize= TRUE ,seed= 17366 ,
                 nlevels=c( 3,5 ), factor.names=list( 
                 Size=c("S","M","L"),Color=c("R","G","B","M","Y"))) ; d4
#+end_src

#+RESULTS:
#+begin_example
 creating full factorial with 15 runs ...

   run.no run.no.std.rp Size Color
1       1           6.1    L     G
2       2          10.1    S     M
3       3          12.1    L     M
4       4           2.1    M     R
5       5          11.1    M     M
6       6          14.1    M     Y
7       7           4.1    S     G
8       8           3.1    L     R
9       9          13.1    S     Y
10     10          15.1    L     Y
11     11           5.1    M     G
12     12           1.1    S     R
13     13           8.1    M     B
14     14           7.1    S     B
15     15           9.1    L     B
16     16           1.2    S     R
17     17           8.2    M     B
18     18          15.2    L     Y
19     19           3.2    L     R
20     20          11.2    M     M
21     21           5.2    M     G
22     22          10.2    S     M
23     23          13.2    S     Y
24     24           4.2    S     G
25     25           7.2    S     B
26     26           9.2    L     B
27     27          14.2    M     Y
28     28           2.2    M     R
29     29           6.2    L     G
30     30          12.2    L     M
31     31          14.3    M     Y
32     32          12.3    L     M
33     33           5.3    M     G
34     34          11.3    M     M
35     35           4.3    S     G
36     36           7.3    S     B
37     37           9.3    L     B
38     38           8.3    M     B
39     39          15.3    L     Y
40     40          13.3    S     Y
41     41           6.3    L     G
42     42           3.3    L     R
43     43          10.3    S     M
44     44           1.3    S     R
45     45           2.3    M     R
class=design, type= full factorial 
NOTE: columns run.no and run.no.std.rp are annotation, not part of the data frame
#+end_example
*** Reducing the size of such designs
You can still sample from it but the outcome is likely to be *not well
balanced*\\[-1.5em]
- $\leadsto$ the *estimation* may *not* be that *good* and probably quite biased
  because of this \frowny

#+begin_src R :results output :session :exports both
d4[sample(size=5,replace=FALSE,1:nrow(d4)),]
#+end_src

#+RESULTS:
:    Size Color
: 29    L     G
: 30    L     M
: 41    L     G
: 3     L     M
: 25    S     B

That's why you should *try to reduce* as much as possible the number of
*factors* and of *levels* if you can
*** What about the analysis?
\scriptsize
#+begin_src R :results output :session :exports both
summary(lm(Response5 ~ (A + B + C)^2, data = d5_HD))
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = Response5 ~ (A + B + C)^2, data = d5_HD)

Residuals:
     Min       1Q   Median       3Q      Max 
-2.90043 -0.64768  0.00095  0.75471  2.61620 

Coefficients:
            Estimate Std. Error t value Pr(>|t|)    
(Intercept)  10.0932     0.5920  17.049   <2e-16 ***
A             1.5542     0.9686   1.605   0.1120    
B             1.1188     0.8904   1.257   0.2121    
C            -1.4085     0.9283  -1.517   0.1326    
A:B          -2.3379     1.3228  -1.767   0.0804 .  
A:C           3.0344     1.2428   2.442   0.0165 *  
B:C           2.9668     1.2910   2.298   0.0238 *  
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 1.087 on 93 degrees of freedom
Multiple R-squared:  0.451,	Adjusted R-squared:  0.4156 
F-statistic: 12.74 on 6 and 93 DF,  p-value: 1.909e-10
#+end_example


#+BEGIN_LaTeX
\begin{flushright}
  \begin{overlayarea}{.3\linewidth}{0cm}
    \vspace{-7.7cm}
    \begin{block}{}
#+END_LaTeX
      \small There is actually too much variability to conclude
      anything here (look at the $R^2$)\smallskip

      We know from the anova that B:C is significant but its
      Std. Error is still 1.29\smallskip

      We should add another round of 3 times more experiments to halve
      it
#+BEGIN_LaTeX
    \end{block}
  \end{overlayarea}
\end{flushright}
#+END_LaTeX

*** What happens if we fit a simpler model ?
\scriptsize
#+begin_src R :results output :session :exports both
summary(lm(Response5 ~ A + B:C, data = d5_HD))
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = Response5 ~ A + B:C, data = d5_HD)

Residuals:
     Min       1Q   Median       3Q      Max 
-3.00860 -0.71419 -0.00565  0.74843  2.98579 

Coefficients:
            Estimate Std. Error t value Pr(>|t|)    
(Intercept)  10.0054     0.2471  40.489  < 2e-16 ***
A             1.8262     0.3920   4.659 1.01e-05 ***
B:C           3.0066     0.5247   5.730 1.13e-07 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 1.119 on 97 degrees of freedom
Multiple R-squared:  0.3938,	Adjusted R-squared:  0.3814 
F-statistic: 31.51 on 2 and 97 DF,  p-value: 2.852e-11
#+end_example

#+BEGIN_LaTeX
\begin{flushright}
  \begin{overlayarea}{.3\linewidth}{0cm}
    \vspace{-5.7cm}
    \begin{block}{}
#+END_LaTeX
      \small The Std. Errors decreased but remain quite high\medskip

      As one could expect, the $R^2$ has decreased\dots \frowny
#+BEGIN_LaTeX
    \end{block}
  \end{overlayarea}
\end{flushright}
#+END_LaTeX

*** Let's cheat... \textcolor{black}{\winkey}
\scriptsize
#+begin_src R :results output :session :exports none
set.seed(42)
#+end_src

#+RESULTS:

#+begin_src R :results output :session :exports both
Response5 = 10 + 2*as.numeric(d5_HD$A) +  3*as.numeric(d5_HD$B)*as.numeric(d5_HD$C) + 
    rnorm(nrow(d5_HD),sd=.2) # Decreasing variability
d5_HD <- add.response(d5_HD, Response5, replace=TRUE)
summary(lm(Response5 ~ (A + B + C)^2, data = d5_HD))
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = Response5 ~ (A + B + C)^2, data = d5_HD)

Residuals:
     Min       1Q   Median       3Q      Max 
-0.50030 -0.10491 -0.00945  0.13446  0.47068 

Coefficients:
            Estimate Std. Error t value Pr(>|t|)    
(Intercept) 10.06454    0.10992  91.558  < 2e-16 ***
A            1.58630    0.17986   8.820 6.41e-14 ***
B            0.13805    0.16533   0.835   0.4059    
C            0.09524    0.17236   0.553   0.5819    
A:B          0.46421    0.24562   1.890   0.0619 .  
A:C          0.30745    0.23078   1.332   0.1860    
B:C          2.33722    0.23972   9.750 6.92e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.2019 on 93 degrees of freedom
Multiple R-squared:  0.9551,	Adjusted R-squared:  0.9522 
F-statistic: 329.9 on 6 and 93 DF,  p-value: < 2.2e-16
#+end_example

#+BEGIN_LaTeX
\begin{flushright}
  \begin{overlayarea}{.3\linewidth}{0cm}
    \vspace{-7cm}
    \begin{block}{}
#+END_LaTeX
      \small One should actually instead fit the simple model
      suggested by the previous analysis:
      #+BEGIN_CENTER
        =y~A+B:C=      
      #+END_CENTER
      You should use *parsimony* both in experiment design and modeling
#+BEGIN_LaTeX
    \end{block}
  \end{overlayarea}
\end{flushright}
#+END_LaTeX
 
*** Parsimony (1/2)
\scriptsize
#+begin_src R :results output :session :exports both
summary(lm(Response5 ~ A + B:C, data = d5_HD))
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = Response5 ~ A + B:C, data = d5_HD)

Residuals:
     Min       1Q   Median       3Q      Max 
-0.56483 -0.11393  0.00626  0.12994  0.46614 

Coefficients:
            Estimate Std. Error t value Pr(>|t|)    
(Intercept) 10.05536    0.04609  218.18   <2e-16 ***
A            1.94985    0.07311   26.67   <2e-16 ***
B:C          2.90476    0.09786   29.68   <2e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.2087 on 97 degrees of freedom
Multiple R-squared:   0.95,	Adjusted R-squared:  0.949 
F-statistic: 921.8 on 2 and 97 DF,  p-value: < 2.2e-16
#+end_example

*** Working out a toy example
\scriptsize
#+begin_src R :results output :session :exports both
x=lhs.design(type= "maximin", nruns=50, nfactors=1, seed=77, 
             factor.names=list(x=c(0,60)))$x
y=3+x^2/60 + x*rnorm(length(x),sd=.3)
df = data.frame(x=x,y=y)
reg_quad <- lm(data=df,y~x+I(x^2))
summary(reg_quad)
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = y ~ x + I(x^2), data = df)

Residuals:
     Min       1Q   Median       3Q      Max 
-21.7802  -4.5247   0.7544   5.1195  20.0284 

Coefficients:
            Estimate Std. Error t value Pr(>|t|)  
(Intercept) 2.124017   4.007473   0.530   0.5986  
x           0.143694   0.310362   0.463   0.6455  
I(x^2)      0.013169   0.005021   2.623   0.0117 *
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 9.483 on 47 degrees of freedom
Multiple R-squared:  0.7647,	Adjusted R-squared:  0.7547 
F-statistic: 76.36 on 2 and 47 DF,  p-value: 1.715e-15
#+end_example

*** Adding more points where there is more variability
\scriptsize
#+begin_src R :results output :session :exports both
x=sqrt(lhs.design( type= "maximin" , nruns= 50 ,nfactors= 1 ,
       seed= 77 , factor.names=list( x=c(0,60^2) ) )$x)
y=3+x^2/60 + x*rnorm(length(x),sd=.3)

df = data.frame(x=x,y=y)
reg_quad <- lm(data=df,y~x+I(x^2))
summary(reg_quad)
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = y ~ x + I(x^2), data = df)

Residuals:
    Min      1Q  Median      3Q     Max 
-27.256  -7.269   1.143   7.702  26.904 

Coefficients:
             Estimate Std. Error t value Pr(>|t|)
(Intercept)  0.292996  10.607678   0.028    0.978
x            0.257212   0.626398   0.411    0.683
I(x^2)       0.012031   0.008495   1.416    0.163

Residual standard error: 12.02 on 47 degrees of freedom
Multiple R-squared:  0.6569,	Adjusted R-squared:  0.6423 
F-statistic: 44.99 on 2 and 47 DF,  p-value: 1.209e-11
#+end_example


#+BEGIN_LaTeX
\begin{flushright}
  \begin{overlayarea}{.3\linewidth}{0cm}
    \vspace{-8.3cm}
    \begin{block}{}
#+END_LaTeX

#+begin_src R :results output graphics :file pdf_babel/var_red_hist.pdf :exports results :width 3 :height 4 :session
hist(x)
#+end_src

#+ATTR_LATEX: :width \linewidth
#+RESULTS:
[[file:pdf_babel/var_red_hist.pdf]]

#+BEGIN_LaTeX
    \end{block}
  \end{overlayarea}
\end{flushright}
#+END_LaTeX

